In [1]:
from pyspark.sql import SparkSession

spark=SparkSession.builder.appName("titanic_df").getOrCreate()

WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by org.apache.spark.unsafe.Platform (file:/home/ubuntu/spark-3.2.4/jars/spark-unsafe_2.12-3.2.4.jar) to constructor java.nio.DirectByteBuffer(long,int)
WARNING: Please consider reporting this to the maintainers of org.apache.spark.unsafe.Platform
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
Using Spark's default log4j profile: org/apache/spark/log4j-defaults.properties
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
23/06/12 02:05:15 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

In [2]:
filepath="/home/ubuntu/working/spark-examples/data/titanic_train.csv"
titanic_sdf = spark.read.csv(filepath, inferSchema=True,header=True)

titanic_sdf.show(5)

[Stage 0:===========================================================(1 + 0) / 1]

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| null|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 5 rows

In [3]:
# 스파크 데이터프레임에서 판다스 데이터프레임으로 바꾸기
titanic_pdf = titanic_sdf.select('*').toPandas()
titanic_pdf

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,None,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"""Johnston, Miss. Catherine Helen """"Carrie""""""",female,NaN,1,2,W./C. 6607,23.4500,None,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,None,Q

# Pandas DataFrame에서 데이터 조작하기
- 컬럼에 대한 삽입과 수정을 쉽게 할 수 있다. `[]`를 사용해서

In [4]:
import numpy as np

titanic_pdf_copy = titanic_pdf.copy()

# Fare에 10을 곱해서 Extra_Fare라는 컬럼에 집어 넣기
titanic_pdf_copy["Extra_Fare"] = titanic_pdf_copy["Fare"]*10
titanic_pdf_copy.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Extra_Fare
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S,72.500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,712.833
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S,79.250
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,531.000
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S,80.500

In [5]:
# 컬럼 데이터 수정
titanic_pdf_copy["Fare"] = titanic_pdf_copy["Fare"] + 20
titanic_pdf_copy

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Extra_Fare
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,27.2500,None,S,72.500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,91.2833,C85,C,712.833
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,27.9250,None,S,79.250
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,73.1000,C123,S,531.000
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,28.0500,None,S,80.500
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,33.0000,None,S,130.000
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,50.0000,B42,S,300.000
888,889,0,3,"""Johnston, Miss. Catherine Helen """"Carrie""""""",female,NaN,1,2,W./C. 6607,43.4500,None,S,234.500
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,50.0000,C148,C,300.000
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,27.7500,None,Q,77.500

In [6]:
titanic_pdf_copy["Fare"] = titanic_pdf_copy["Fare"].astype(np.int64)
titanic_pdf_copy.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Extra_Fare
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,27,None,S,72.500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,91,C85,C,712.833
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,27,None,S,79.250
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,73,C123,S,531.000
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,28,None,S,80.500

# Spark Dataframe의 데이터 조작
- `withColumn()` 메소드를 이용하여 기존 컬럼 값을 수정, 타입 변경, 신규 컬럼을 추가할 수 있다.
    - `withColumn('신규 또는 업데이트 되는 컬럼명, '신규 또는 업데이트 되는 값')`
- 신규 또는 업데이트 되는 값을 생성 시에 기존 컬럼을 기반으로 한다면 신규 컬럼은 **문자열로**, 기존 컬럼은 반드시 컬럼 객체(col('컬럼명'))을 사용
- 신규 컬럼을 추가하는 것은 `select`로도 가능
- 컬럼명 변경은 `withColumnRenamed()` 메소드 사용 가능

In [7]:
from pyspark.sql.functions import col

# 스파크에서 copy하는 법
titanic_sdf_copy = titanic_sdf.select("*")

titanic_sdf_copy = titanic_sdf_copy.withColumn("Extra_Fare", col("Fare") * 10)
# col은 시리즈와 같은 역할을 한다.
titanic_sdf_copy.show(5)

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+----------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|Extra_Fare|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+----------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|      72.5|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|   712.833|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|     79.25|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|     531.0|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| null|       S|      80.5|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+----------+
only showing top 5 rows

In [8]:
# 기존 컬럼 UPDATE
titanic_sdf_copy = titanic_sdf_copy.withColumn("Fare",col("Fare")+20)
titanic_sdf_copy.show(5)

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+----------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|Extra_Fare|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+----------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|  27.25| null|       S|      72.5|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|91.2833|  C85|       C|   712.833|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282| 27.925| null|       S|     79.25|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   73.1| C123|       S|     531.0|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|  28.05| null|       S|      80.5|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+----------+
only showing top 5 rows

In [9]:
# 컬럼의 데이터 형태 변환은 cast 사용
titanic_sdf_copy = titanic_sdf_copy.withColumn("Fare", col("Fare").cast("integer"))
titanic_sdf_copy.show(5)

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+----+-----+--------+----------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|Fare|Cabin|Embarked|Extra_Fare|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+----+-----+--------+----------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|  27| null|       S|      72.5|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|  91|  C85|       C|   712.833|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  27| null|       S|     79.25|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|  73| C123|       S|     531.0|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|  28| null|       S|      80.5|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+----+-----+--------+----------+
only showing top 5 rows

In [11]:
# pandas 에서 상숫값으로 데이터를 삽입하거나 수정하기
titanic_pdf_copy["Extra_Fare"] = 10
titanic_pdf_copy.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Extra_Fare
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,27,None,S,10
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,91,C85,C,10
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,27,None,S,10
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,73,C123,S,10
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,28,None,S,10

In [13]:
# spark에서 상숫값으로 데이터를 삽입하거나 수정하기
titanic_sdf_copy = titanic_sdf_copy.withColumn("Extra_Fare", 10) # 업데이트 할 값은 반드시 컬럼형이 되어야 한다.
                                                                # 브로드 캐스팅이 일어나지 않는다.
titanic_sdf_copy.show(5)

TypeError: col should be Column

상수(변경이 안되는 수)
- CONST : 변수를 상수화. python에는 없다. spark는 자바 기반. 초기화만 가능한 변수. 대입은 불가능
- LITERAL : 코드에 나타난 값

In [14]:
# spark에서 상숫값으로 업데이트 하려면 반드시 lit 함수를 적용할 것
from pyspark.sql.functions import lit

titanic_sdf_copy = titanic_sdf_copy.withColumn("Extra_Fare", lit(10))
titanic_sdf_copy.show(5)

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+----+-----+--------+----------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|Fare|Cabin|Embarked|Extra_Fare|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+----+-----+--------+----------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|  27| null|       S|        10|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|  91|  C85|       C|        10|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  27| null|       S|        10|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|  73| C123|       S|        10|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|  28| null|       S|        10|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+----+-----+--------+----------+
only showing top 5 rows

In [15]:
titanic_sdf_copy = titanic_sdf_copy.withColumn("New_Column", lit("Test Column입니다"))
titanic_sdf_copy.show(5)

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+----+-----+--------+----------+-----------------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|Fare|Cabin|Embarked|Extra_Fare|       New_Column|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+----+-----+--------+----------+-----------------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|  27| null|       S|        10|Test Column입니다|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|  91|  C85|       C|        10|Test Column입니다|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  27| null|       S|        10|Test Column입니다|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|  73| C123|       S|        10|Test Column입니다|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|  28| null|       S|        10|Test Column입니다|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+----+-----+--------+----------+-----------------+
only showing top 5 rows

In [19]:
from pyspark.sql.functions import substring

# select() 메소드를 이용해서 컬럼을 추가. 이 때 SQL의 substring 메소드를 이용해 문자열의 일부를 추출하여 신규 컬럼 생성.
titanic_sdf_copy = titanic_sdf_copy.select("*" , col("Embarked").alias("E")) # select * Embarked as E from titanic_sdf
titanic_sdf_copy = titanic_sdf_copy.select("*", substring("Cabin",0,1).alias("Cabin_Section"))
titanic_sdf_copy.show(5)

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+----+-----+--------+----------+-----------------+---+---+---+----------------------+---+-------------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|Fare|Cabin|Embarked|Extra_Fare|       New_Column|  E|  E|  E|substring(Cabin, 0, 1)|  E|Cabin_Section|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+----+-----+--------+----------+-----------------+---+---+---+----------------------+---+-------------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|  27| null|       S|        10|Test Column입니다|  S|  S|  S|                  null|  S|         null|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|  91|  C85|       C|        10|Test Column입니다|  C|  C|  C|                     C|  C|            C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  27| null|       S|        10|Test Column입니다|  S|  S|  S|                  null|  S|         null|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|  73| C123|       S|        10|Test Column입니다|  S|  S|  S|                     C|  S|            C|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|  28| null|       S|        10|Test Column입니다|  S|  S|  S|                  null|  S|         null|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+----+-----+--------+----------+-----------------+---+---+---+----------------------+---+-------------+
only showing top 5 rows

In [21]:
titanic_sdf_copy = titanic_sdf_copy.select("*")
titanic_sdf_copy = titanic_sdf_copy.withColumn("탑승지", col("Embarked")).withColumn("Cabin_Section", substring("Cabin",0,1))

#메소드 체이닝 : 메소드를 이어서 쓸 수 있는 것. 호출되는 것이 객체라면

In [22]:
titanic_sdf_copy.show(5)

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+----+-----+--------+----------+-----------------+---+---+---+----------------------+---+-------------+------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|Fare|Cabin|Embarked|Extra_Fare|       New_Column|  E|  E|  E|substring(Cabin, 0, 1)|  E|Cabin_Section|탑승지|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+----+-----+--------+----------+-----------------+---+---+---+----------------------+---+-------------+------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|  27| null|       S|        10|Test Column입니다|  S|  S|  S|                  null|  S|         null|     S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|  91|  C85|       C|        10|Test Column입니다|  C|  C|  C|                     C|  C|            C|     C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  27| null|       S|        10|Test Column입니다|  S|  S|  S|                  null|  S|         null|     S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|  73| C123|       S|        10|Test Column입니다|  S|  S|  S|                     C|  S|            C|     S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|  28| null|       S|        10|Test Column입니다|  S|  S|  S|                  null|  S|         null|     S|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+----+-----+--------+----------+-----------------+---+---+---+----------------------+---+-------------+------+
only showing top 5 rows

In [23]:
from pyspark.sql.functions import split

# Name 컬럼을  ","로 분리하여 Name1, Name2 생성

# spark에서는 인덱스 []가 안되기 때문에 getItem을 쓴다.
titanic_sdf_copy = titanic_sdf_copy.withColumn("first_name", split(col("Name"),",").getItem(0))
titanic_sdf_copy = titanic_sdf_copy.withColumn("last_name", split(col("Name"),",").getItem(1))

In [24]:
titanic_sdf_copy.show(5)

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+----+-----+--------+----------+-----------------+---+---+---+----------------------+---+-------------+------+----------+--------------------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|Fare|Cabin|Embarked|Extra_Fare|       New_Column|  E|  E|  E|substring(Cabin, 0, 1)|  E|Cabin_Section|탑승지|first_name|           last_name|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+----+-----+--------+----------+-----------------+---+---+---+----------------------+---+-------------+------+----------+--------------------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|  27| null|       S|        10|Test Column입니다|  S|  S|  S|                  null|  S|         null|     S|    Braund|     Mr. Owen Harris|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|  91|  C85|       C|        10|Test Column입니다|  C|  C|  C|                     C|  C|            C|     C|   Cumings| Mrs. John Bradle...|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  27| null|       S|        10|Test Column입니다|  S|  S|  S|                  null|  S|         null|     S| Heikkinen|         Miss. Laina|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|  73| C123|       S|        10|Test Column입니다|  S|  S|  S|                     C|  S|            C|     S|  Futrelle| Mrs. Jacques Hea...|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|  28| null|       S|        10|Test Column입니다|  S|  S|  S|                  null|  S|         null|     S|     Allen|   Mr. William Henry|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+----+-----+--------+----------+-----------------+---+---+---+----------------------+---+-------------+------+----------+--------------------+
only showing top 5 rows

In [27]:
# 컬럼 이름 바꾸기
titanic_sdf_copy = titanic_sdf_copy.withColumnRenamed("탑승지","탑탑승지")
titanic_sdf_copy.show(5)

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+----+-----+--------+----------+-----------------+---+---+---+----------------------+---+-------------+--------+----------+--------------------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|Fare|Cabin|Embarked|Extra_Fare|       New_Column|  E|  E|  E|substring(Cabin, 0, 1)|  E|Cabin_Section|탑탑승지|first_name|           last_name|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+----+-----+--------+----------+-----------------+---+---+---+----------------------+---+-------------+--------+----------+--------------------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|  27| null|       S|        10|Test Column입니다|  S|  S|  S|                  null|  S|         null|       S|    Braund|     Mr. Owen Harris|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|  91|  C85|       C|        10|Test Column입니다|  C|  C|  C|                     C|  C|            C|       C|   Cumings| Mrs. John Bradle...|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  27| null|       S|        10|Test Column입니다|  S|  S|  S|                  null|  S|         null|       S| Heikkinen|         Miss. Laina|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|  73| C123|       S|        10|Test Column입니다|  S|  S|  S|                     C|  S|            C|       S|  Futrelle| Mrs. Jacques Hea...|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|  28| null|       S|        10|Test Column입니다|  S|  S|  S|                  null|  S|         null|       S|     Allen|   Mr. William Henry|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+----+-----+--------+----------+-----------------+---+---+---+----------------------+---+-------------+--------+----------+--------------------+
only showing top 5 rows

In [28]:
# 주의! 없는 컬럼을 넣어도 오류가 나지 않는다! 확인 꼭 필요!
titanic_sdf_copy = titanic_sdf_copy.withColumnRenamed("없는 컬럼을 집어 넣어도","오류가 안나요!")
titanic_sdf_copy.show(5)

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+----+-----+--------+----------+-----------------+---+---+---+----------------------+---+-------------+--------+----------+--------------------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|Fare|Cabin|Embarked|Extra_Fare|       New_Column|  E|  E|  E|substring(Cabin, 0, 1)|  E|Cabin_Section|탑탑승지|first_name|           last_name|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+----+-----+--------+----------+-----------------+---+---+---+----------------------+---+-------------+--------+----------+--------------------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|  27| null|       S|        10|Test Column입니다|  S|  S|  S|                  null|  S|         null|       S|    Braund|     Mr. Owen Harris|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|  91|  C85|       C|        10|Test Column입니다|  C|  C|  C|                     C|  C|            C|       C|   Cumings| Mrs. John Bradle...|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  27| null|       S|        10|Test Column입니다|  S|  S|  S|                  null|  S|         null|       S| Heikkinen|         Miss. Laina|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|  73| C123|       S|        10|Test Column입니다|  S|  S|  S|                     C|  S|            C|       S|  Futrelle| Mrs. Jacques Hea...|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|  28| null|       S|        10|Test Column입니다|  S|  S|  S|                  null|  S|         null|       S|     Allen|   Mr. William Henry|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+----+-----+--------+----------+-----------------+---+---+---+----------------------+---+-------------+--------+----------+--------------------+
only showing top 5 rows

# Spark Dataframe의 컬럼, 로우(레코드) 삭제
- pandas의 데이터프레임은 `drop` 메소드를 사용.
- spark 데이터프레임에도 `drop`이 존재. 컬럼만 삭제 가능
    - 여러 개 삭제 시 'list' 사용 불가
- spark에서는 데이터 삭제가 원칙적으로는 없다.
    - 일반적으로 데이터란? 행(레코드)
    - 데이터 삭제가 없는 대신에 `filter`를 이용해서 필요한 것만 추출해 낸다.

In [32]:
titanic_pdf_dropped = titanic_pdf.drop("Name", axis=1 , inplace=False)
titanic_pdf_dropped.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int32
 1   Survived     891 non-null    int32
 2   Pclass       891 non-null    int32
 3   Sex          891 non-null    object
 4   Age          714 non-null    float64
 5   SibSp        891 non-null    int32
 6   Parch        891 non-null    int32
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    float64
 9   Cabin        204 non-null    object
 10  Embarked     889 non-null    object
dtypes: float64(2), int32(5), object(4)
memory usage: 59.3+ KB

In [33]:
titanic_sdf_copy = titanic_sdf.select("*")
titanic_sdf_copy = titanic_sdf_copy.drop(col("Embarked")) # 컬럼 형을 써도 되고, 문자열을 써도 됨.
titanic_sdf_copy.printSchema() # Embarked 컬럼이 사라진 것을 확인

root
 |-- PassengerId: integer (nullable = true)
 |-- Survived: integer (nullable = true)
 |-- Pclass: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Age: double (nullable = true)
 |-- SibSp: integer (nullable = true)
 |-- Parch: integer (nullable = true)
 |-- Ticket: string (nullable = true)
 |-- Fare: double (nullable = true)
 |-- Cabin: string (nullable = true)

In [39]:
# 여러 개의 컬럼을 한꺼번에 삭제하기. col을 쓰면 안됨
titanic_sdf_copy.drop("Fare","Cabin").printSchema()
titanic_sdf_copy.drop(col("Fare"),col("Cabin")).printSchema()

root
 |-- PassengerId: integer (nullable = true)
 |-- Survived: integer (nullable = true)
 |-- Pclass: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Age: double (nullable = true)
 |-- SibSp: integer (nullable = true)
 |-- Parch: integer (nullable = true)
 |-- Ticket: string (nullable = true)

TypeError: each col in the param list should be a string

In [38]:
# drop에 리스트로 컬럼명들을 묶어서 삭제를 시도하면 오류
titanic_sdf_copy.drop(["Fare","Cabin"]).printSchema()

TypeError: col should be a string or a Column

In [40]:
drop_columns = ["Fare","Cabin"]
titanic_sdf_copy.drop(*drop_columns).printSchema() # 언패킹은 *

root
 |-- PassengerId: integer (nullable = true)
 |-- Survived: integer (nullable = true)
 |-- Pclass: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Age: double (nullable = true)
 |-- SibSp: integer (nullable = true)
 |-- Parch: integer (nullable = true)
 |-- Ticket: string (nullable = true)

In [41]:
titanic_sdf_copy.dtypes

[('PassengerId', 'int'),
 ('Survived', 'int'),
 ('Pclass', 'int'),
 ('Name', 'string'),
 ('Sex', 'string'),
 ('Age', 'double'),
 ('SibSp', 'int'),
 ('Parch', 'int'),
 ('Ticket', 'string'),
 ('Fare', 'double'),
 ('Cabin', 'string')]

In [56]:
# 문자열 형태의 컬럼만 삭제하는 로직 작성하기

drop_string_columns = [column_name for column_name, column_type in titanic_sdf_copy.dtypes if column_type == "string"]
print("drop columns :", drop_string_columns)

titanic_sdf_copy.drop(*drop_columns).printSchema()
# 콜럼 삭제는 되는데 레코드는 안되는 이유 : 레코드의 삭제는 다시 복원할 때 다시 파티션이 일어나야하기 때문에 셔플링이 일어난다. 이것을 방지

drop columns : ['Name', 'Sex', 'Ticket', 'Cabin']
root
 |-- PassengerId: integer (nullable = true)
 |-- Survived: integer (nullable = true)
 |-- Pclass: integer (nullable = true)
 |-- Age: double (nullable = true)
 |-- SibSp: integer (nullable = true)
 |-- Parch: integer (nullable = true)
 |-- Fare: double (nullable = true)

In [57]:
# Pclass=1인 로우를 삭제. 하지만 실제로는 삭제가 아닌, pclass !=1 인 데이터만 가져오는 것
titanic_sdf_removed_pclass_1 = titanic_sdf.filter(col("Pclass") !=1)
titanic_sdf_removed_pclass_1.show()

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| null|       S|
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|          330877| 8.4583| null|       Q|
|          8|       0|     3|Palsson, Master. ...|  male| 2.0|    3|    1|          349909| 21.075| null|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742|11.1333| null|       S|
|         10|       1|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|          237736|30.0708| null|       C|
|         11|       1|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|         PP 9549|   16.7|   G6|       S|
|         13|       0|     3|Saundercock, Mr. ...|  male|20.0|    0|    0|       A/5. 2151|   8.05| null|       S|
|         14|       0|     3|Andersson, Mr. An...|  male|39.0|    1|    5|          347082| 31.275| null|       S|
|         15|       0|     3|Vestrom, Miss. Hu...|female|14.0|    0|    0|          350406| 7.8542| null|       S|
|         16|       1|     2|Hewlett, Mrs. (Ma...|female|55.0|    0|    0|          248706|   16.0| null|       S|
|         17|       0|     3|Rice, Master. Eugene|  male| 2.0|    4|    1|          382652| 29.125| null|       Q|
|         18|       1|     2|Williams, Mr. Cha...|  male|null|    0|    0|          244373|   13.0| null|       S|
|         19|       0|     3|Vander Planke, Mr...|female|31.0|    1|    0|          345763|   18.0| null|       S|
|         20|       1|     3|Masselmani, Mrs. ...|female|null|    0|    0|            2649|  7.225| null|       C|
|         21|       0|     2|Fynney, Mr. Joseph J|  male|35.0|    0|    0|          239865|   26.0| null|       S|
|         22|       1|     2|Beesley, Mr. Lawr...|  male|34.0|    0|    0|          248698|   13.0|  D56|       S|
|         23|       1|     3|"McGowan, Miss. A...|female|15.0|    0|    0|          330923| 8.0292| null|       Q|
|         25|       0|     3|Palsson, Miss. To...|female| 8.0|    3|    1|          349909| 21.075| null|       S|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

# Spark Dataframe의 dropna 사용하기

In [60]:
# 레코드에 하나라도 null 또는 NaN값이 있으면 삭제한 결과 Dataframe이 반환된다.

print("dropna 이전 : ", titanic_sdf.count())
titanic_sdf_dropna_1 = titanic_sdf.dropna()
print("dropna 이후 : ", titanic_sdf_dropna_1.count())

dropna 이전 :  891
dropna 이후 :  183

In [62]:
print("dropna 이전 : ", titanic_sdf.count())
titanic_sdf_dropna_2 = titanic_sdf.na.drop()
print("dropna 이후 : ", titanic_sdf_dropna_2.count())
print("titanic_sdf.na의 타입 : ", type(titanic_sdf.na))

dropna 이전 :  891
dropna 이후 :  183
titanic_sdf.na의 타입 :  <class 'pyspark.sql.dataframe.DataFrameNaFunctions'>

모든 컬럼에 NaN, Null, None이 없어야지 필터링이 안된다.
```sql
select *
from titanic_sdf
where Name is not null
  and age is not null
  and Embarked is not null
```

In [63]:
# 특정 컬럼을 지정하여 거기에 Null이 있는 경우에만 삭제
titanic_sdf_dropna_3 = titanic_sdf.na.drop(subset=["Age","Embarked"])
print("dropna 이후 : ", titanic_sdf_dropna_3.count())

dropna 이후 :  712

In [64]:
# Null이 아닌 Age와 Embarked의 개수
# select count(*) from titanic_sdf where age is not null and embarked is not null

# col(c).isNotNull 사용해보기

titanic_sdf.filter(col("Age").isNotNull() & col("Embarked").isNotNull()).count()

712

In [66]:
# dropna() 메소드를 로직으로 구현. 
where_str = ''
column_count = len(titanic_sdf.columns)
for index, column_name in enumerate(titanic_sdf.columns):
    where_str += (column_name +' IS NOT NULL ') 
    if index < column_count - 1:
        where_str += 'and '
print(where_str)

PassengerId IS NOT NULL and Survived IS NOT NULL and Pclass IS NOT NULL and Name IS NOT NULL and Sex IS NOT NULL and Age IS NOT NULL and SibSp IS NOT NULL and Parch IS NOT NULL and Ticket IS NOT NULL and Fare IS NOT NULL and Cabin IS NOT NULL and Embarked IS NOT NULL

In [67]:
titanic_sdf.filter(where_str).count()

183

None -> 없음. None은 하나의 객체다. None type클래스의 객체가 None : 내장 상수

python - None
Java, SQL - None X , null
numpy - None : 객체가 없을 때, NaN : 숫자가 없을 때

spark - Null : None를 Null로 처리, NaN : 숫자가 없는 경우

스파크 3.0 이하 : Pandas DF => spark DF로 변환시, NaN->NaN
★스파크 3.0 이후 : Pandas DF => spark DF로 변환시, NaN->Null
- isnan X , isNull을 쓸 것. 전처리에서 nan값을 없애고 Null 값으로 바꾸기

# Pandas와 Spark에서의 None, Null, NaN

In [68]:
a = None
print(type(a), a)

<class 'NoneType'> None

In [70]:
titanic_sdf.show(10)
titanic_pdf.head(10)

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| null|       S|
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|          330877| 8.4583| null|       Q|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|           17463|51.8625|  E46|       S|
|          8|       0|     3|Palsson, Master. ...|  male| 2.0|    3|    1|          349909| 21.075| null|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742|11.1333| null|       S|
|         10|       1|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|          237736|30.0708| null|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 10 rows

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,None,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,None,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,None,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,None,C

In [76]:
import pandas as pd
import numpy as np

# none은 object형 array에만 넣을 수 있다.
array = np.array([0,1,2,'hello',None])
print(array, array.dtype)

[0 1 2 'hello' None] object

In [77]:
# 숫자 형식의 array는 None이 NaN으로 바뀐다.
array = np.array([0,1,2,None], dtype=np.float32)
print(array, array.dtype)

[ 0.  1.  2. nan] float32

In [78]:
print(titanic_pdf['Cabin'].to_numpy().dtype) # None - object
print(titanic_pdf['Age'].to_numpy().dtype) # NaN - float64

object
float64

In [ ]:
# spark 3.2 버전에서는 pandas DataFrame으로 Spark DataFrame을 생성해도 NaN,
#추가할것

# Spark Dataframe에서 Null과 NaN 찾기
- pandas의 isnull(), isna()는 서로 동일한 메소드로서 모두 None과 NaN을 찾는다.
- spark의 isnull(),isna()는 서로 다른 것을 찾는다.
    - isnull() : None을 찾음
    - isna() : NaN을 찾는다.

In [82]:
# pandas에서는 isna와 isnull은 동일하다
print(titanic_pdf[["Age","Cabin"]].head(10))
print()
print(titanic_pdf[["Age","Cabin"]].isna().head(10))
print()
print(titanic_pdf[["Age","Cabin"]].isnull().head(10))

    Age Cabin
0  22.0  None
1  38.0   C85
2  26.0  None
3  35.0  C123
4  35.0  None
5   NaN  None
6  54.0   E46
7   2.0  None
8  27.0  None
9  14.0  None

     Age  Cabin
0  False   True
1  False  False
2  False   True
3  False  False
4  False   True
5   True   True
6  False  False
7  False   True
8  False   True
9  False   True

     Age  Cabin
0  False   True
1  False  False
2  False   True
3  False  False
4  False   True
5   True   True
6  False  False
7  False   True
8  False   True
9  False   True

In [85]:
# Spark에서 isNull()은 컬럼 형식에서만 사용이 가능. isnan은 pyspark.sql.functions에서 불러와야 사용 가능
from pyspark.sql.functions import col, isnan

titanic_sdf.filter(col("Age").isNull()).show(10)
titanic_sdf.filter(isnan(col("Age"))).show(10)

+-----------+--------+------+--------------------+------+----+-----+-----+--------+--------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|  Ticket|    Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+--------+--------+-----+--------+
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|  330877|  8.4583| null|       Q|
|         18|       1|     2|Williams, Mr. Cha...|  male|null|    0|    0|  244373|    13.0| null|       S|
|         20|       1|     3|Masselmani, Mrs. ...|female|null|    0|    0|    2649|   7.225| null|       C|
|         27|       0|     3|Emir, Mr. Farred ...|  male|null|    0|    0|    2631|   7.225| null|       C|
|         29|       1|     3|"O'Dwyer, Miss. E...|female|null|    0|    0|  330959|  7.8792| null|       Q|
|         30|       0|     3| Todoroff, Mr. Lalio|  male|null|    0|    0|  349216|  7.8958| null|       S|
|         32|       1|     1|Spencer, Mrs. Wil...|female|null|    1|    0|PC 17569|146.5208|  B78|       C|
|         33|       1|     3|Glynn, Miss. Mary...|female|null|    0|    0|  335677|    7.75| null|       Q|
|         37|       1|     3|    Mamee, Mr. Hanna|  male|null|    0|    0|    2677|  7.2292| null|       C|
|         43|       0|     3| Kraeff, Mr. Theodor|  male|null|    0|    0|  349253|  7.8958| null|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+--------+--------+-----+--------+
only showing top 10 rows

+-----------+--------+------+----+---+---+-----+-----+------+----+-----+--------+
|PassengerId|Survived|Pclass|Name|Sex|Age|SibSp|Parch|Ticket|Fare|Cabin|Embarked|
+-----------+--------+------+----+---+---+-----+-----+------+----+-----+--------+
+-----------+--------+------+----+---+---+-----+-----+------+----+-----+--------+

# Null이 있는 컬럼명과 Null 개수 찾기

In [87]:
titanic_sdf.select([col(column_name).isNull() for column_name in titanic_sdf.columns]).show()
titanic_sdf.select([col(column_name).isNull().alias(column_name) for column_name in titanic_sdf.columns]).show()

+---------------------+------------------+----------------+--------------+-------------+-------------+---------------+---------------+----------------+--------------+---------------+------------------+
|(PassengerId IS NULL)|(Survived IS NULL)|(Pclass IS NULL)|(Name IS NULL)|(Sex IS NULL)|(Age IS NULL)|(SibSp IS NULL)|(Parch IS NULL)|(Ticket IS NULL)|(Fare IS NULL)|(Cabin IS NULL)|(Embarked IS NULL)|
+---------------------+------------------+----------------+--------------+-------------+-------------+---------------+---------------+----------------+--------------+---------------+------------------+
|                false|             false|           false|         false|        false|        false|          false|          false|           false|         false|           true|             false|
|                false|             false|           false|         false|        false|        false|          false|          false|           false|         false|          false|             false|
|                false|             false|           false|         false|        false|        false|          false|          false|           false|         false|           true|             false|
|                false|             false|           false|         false|        false|        false|          false|          false|           false|         false|          false|             false|
|                false|             false|           false|         false|        false|        false|          false|          false|           false|         false|           true|             false|
|                false|             false|           false|         false|        false|         true|          false|          false|           false|         false|           true|             false|
|                false|             false|           false|         false|        false|        false|          false|          false|           false|         false|          false|             false|
|                false|             false|           false|         false|        false|        false|          false|          false|           false|         false|           true|             false|
|                false|             false|           false|         false|        false|        false|          false|          false|           false|         false|           true|             false|
|                false|             false|           false|         false|        false|        false|          false|          false|           false|         false|           true|             false|
|                false|             false|           false|         false|        false|        false|          false|          false|           false|         false|          false|             false|
|                false|             false|           false|         false|        false|        false|          false|          false|           false|         false|          false|             false|
|                false|             false|           false|         false|        false|        false|          false|          false|           false|         false|           true|             false|
|                false|             false|           false|         false|        false|        false|          false|          false|           false|         false|           true|             false|
|                false|             false|           false|         false|        false|        false|          false|          false|           false|         false|           true|             false|
|                false|             false|           false|         false|        false|        false|          false|          false|           false|         false|           true|             false|
|                false|             false|           false|         false|        false|        false|          false|          false|           false|         false|           true|             false|
|                false|             false|           false|         false|        false|         true|          false|          false|           false|         false|           true|             false|
|                false|             false|           false|         false|        false|        false|          false|          false|           false|         false|           true|             false|
|                false|             false|           false|         false|        false|         true|          false|          false|           false|         false|           true|             false|
+---------------------+------------------+----------------+--------------+-------------+-------------+---------------+---------------+----------------+--------------+---------------+------------------+
only showing top 20 rows

+-----------+--------+------+-----+-----+-----+-----+-----+------+-----+-----+--------+
|PassengerId|Survived|Pclass| Name|  Sex|  Age|SibSp|Parch|Ticket| Fare|Cabin|Embarked|
+-----------+--------+------+-----+-----+-----+-----+-----+------+-----+-----+--------+
|      false|   false| false|false|false|false|false|false| false|false| true|   false|
|      false|   false| false|false|false|false|false|false| false|false|false|   false|
|      false|   false| false|false|false|false|false|false| false|false| true|   false|
|      false|   false| false|false|false|false|false|false| false|false|false|   false|
|      false|   false| false|false|false|false|false|false| false|false| true|   false|
|      false|   false| false|false|false| true|false|false| false|false| true|   false|
|      false|   false| false|false|false|false|false|false| false|false|false|   false|
|      false|   false| false|false|false|false|false|false| false|false| true|   false|
|      false|   false| false|false|false|false|false|false| false|false| true|   false|
|      false|   false| false|false|false|false|false|false| false|false| true|   false|
|      false|   false| false|false|false|false|false|false| false|false|false|   false|
|      false|   false| false|false|false|false|false|false| false|false|false|   false|
|      false|   false| false|false|false|false|false|false| false|false| true|   false|
|      false|   false| false|false|false|false|false|false| false|false| true|   false|
|      false|   false| false|false|false|false|false|false| false|false| true|   false|
|      false|   false| false|false|false|false|false|false| false|false| true|   false|
|      false|   false| false|false|false|false|false|false| false|false| true|   false|
|      false|   false| false|false|false| true|false|false| false|false| true|   false|
|      false|   false| false|false|false|false|false|false| false|false| true|   false|
|      false|   false| false|false|false| true|false|false| false|false| true|   false|
+-----------+--------+------+-----+-----+-----+-----+-----+------+-----+-----+--------+
only showing top 20 rows

In [88]:
from pyspark.sql.functions import count, when
 
titanic_sdf.select([count(when(col(c).isNull(), c)).alias(c) for c in titanic_sdf.columns]).show() # when(조건, 참 exp, 거짓 exp)

+-----------+--------+------+----+---+---+-----+-----+------+----+-----+--------+
|PassengerId|Survived|Pclass|Name|Sex|Age|SibSp|Parch|Ticket|Fare|Cabin|Embarked|
+-----------+--------+------+----+---+---+-----+-----+------+----+-----+--------+
|          0|       0|     0|   0|  0|177|    0|    0|     0|   0|  687|       2|
+-----------+--------+------+----+---+---+-----+-----+------+----+-----+--------+

```python
col(c).isnull()이 true인 경우
-> when(col(c).isNull(), c)
-> count(c)
```

# Null 값 처리하기

In [89]:
# Pandas Dataframe에서 Age의 NaN값을 나이의 평균으로 채우기
titanic_pdf["Age"] = titanic_pdf["Age"].fillna(titanic_pdf['Age'].mean(), inplace=False)
titanic_pdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int32
 1   Survived     891 non-null    int32
 2   Pclass       891 non-null    int32
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int32
 7   Parch        891 non-null    int32
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int32(5), object(5)
memory usage: 66.3+ KB

In [90]:
# 스파크 데이터프레임에서 결측치(Null)을 채우는 방법
# 1. fillna(숫자 데이터에만)
titanic_sdf.fillna(value=999).show(10) # value가 숫자면 숫자데이터에만 값이 채워진다
#2. na.fill
titanic_sdf.na.fill(value=999).show(10)

+-----------+--------+------+--------------------+------+-----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex|  Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+-----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male| 22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female| 38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female| 26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female| 35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male| 35.0|    0|    0|          373450|   8.05| null|       S|
|          6|       0|     3|    Moran, Mr. James|  male|999.0|    0|    0|          330877| 8.4583| null|       Q|
|          7|       0|     1|McCarthy, Mr. Tim...|  male| 54.0|    0|    0|           17463|51.8625|  E46|       S|
|          8|       0|     3|Palsson, Master. ...|  male|  2.0|    3|    1|          349909| 21.075| null|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female| 27.0|    0|    2|          347742|11.1333| null|       S|
|         10|       1|     2|Nasser, Mrs. Nich...|female| 14.0|    1|    0|          237736|30.0708| null|       C|
+-----------+--------+------+--------------------+------+-----+-----+-----+----------------+-------+-----+--------+
only showing top 10 rows

+-----------+--------+------+--------------------+------+-----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex|  Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+-----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male| 22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female| 38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female| 26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female| 35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male| 35.0|    0|    0|          373450|   8.05| null|       S|
|          6|       0|     3|    Moran, Mr. James|  male|999.0|    0|    0|          330877| 8.4583| null|       Q|
|          7|       0|     1|McCarthy, Mr. Tim...|  male| 54.0|    0|    0|           17463|51.8625|  E46|       S|
|          8|       0|     3|Palsson, Master. ...|  male|  2.0|    3|    1|          349909| 21.075| null|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female| 27.0|    0|    2|          347742|11.1333| null|       S|
|         10|       1|     2|Nasser, Mrs. Nich...|female| 14.0|    1|    0|          237736|30.0708| null|       C|
+-----------+--------+------+--------------------+------+-----+-----+-----+----------------+-------+-----+--------+
only showing top 10 rows

In [91]:
titanic_sdf.fillna(value="NA").show(10)

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25|   NA|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925|   NA|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05|   NA|       S|
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|          330877| 8.4583|   NA|       Q|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|           17463|51.8625|  E46|       S|
|          8|       0|     3|Palsson, Master. ...|  male| 2.0|    3|    1|          349909| 21.075|   NA|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742|11.1333|   NA|       S|
|         10|       1|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|          237736|30.0708|   NA|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 10 rows

숫자형식의 데이터가 들어가면 숫자 컬럼에만 결측치가 채워지고, 문자열 형식의 데이터가 들어가면 문자열 컬럼에만 결측치가 채워진다.

In [92]:
# subset을 이용해서 특정 컬럼에만 Null값 처리하기

titanic_sdf.fillna(value=999, subset=['Age']).show(10)

titanic_sdf.fillna(value="NA", subset=["Cabin"]).show(10)

+-----------+--------+------+--------------------+------+-----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex|  Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+-----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male| 22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female| 38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female| 26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female| 35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male| 35.0|    0|    0|          373450|   8.05| null|       S|
|          6|       0|     3|    Moran, Mr. James|  male|999.0|    0|    0|          330877| 8.4583| null|       Q|
|          7|       0|     1|McCarthy, Mr. Tim...|  male| 54.0|    0|    0|           17463|51.8625|  E46|       S|
|          8|       0|     3|Palsson, Master. ...|  male|  2.0|    3|    1|          349909| 21.075| null|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female| 27.0|    0|    2|          347742|11.1333| null|       S|
|         10|       1|     2|Nasser, Mrs. Nich...|female| 14.0|    1|    0|          237736|30.0708| null|       C|
+-----------+--------+------+--------------------+------+-----+-----+-----+----------------+-------+-----+--------+
only showing top 10 rows

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25|   NA|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925|   NA|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05|   NA|       S|
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|          330877| 8.4583|   NA|       Q|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|           17463|51.8625|  E46|       S|
|          8|       0|     3|Palsson, Master. ...|  male| 2.0|    3|    1|          349909| 21.075|   NA|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742|11.1333|   NA|       S|
|         10|       1|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|          237736|30.0708|   NA|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 10 rows

In [93]:
# Aged에 대한 결측치 처리를 Age의 평균으로 하기
from pyspark.sql.functions import avg, col
import pyspark.sql.functions as F

avg_age = titanic_sdf.select(F.avg(F.col("Age")))
avg_age.show()
type(avg_age)

# 데이터프레임으로 나오기 때문에 따로 값을 추출하는 것이 필요

+-----------------+
|         avg(Age)|
+-----------------+
|29.69911764705882|
+-----------------+

pyspark.sql.dataframe.DataFrame

In [94]:
# value 인자로 데이터프레임이 들어가면 오류
titanic_sdf.fillna(value=avg_age, subset=["Age"])

TypeError: value should be a float, int, string, bool or dict

In [95]:
# collect(), head(), fist() 등을 통해 row값들을 별도로 가져올 수 있음
avg_age_row = avg_age.first()
avg_age_row, type(avg_age_row)

(Row(avg(Age)=29.69911764705882), pyspark.sql.types.Row)

In [96]:
avg_age_value = avg_age_row[0]
avg_age_value, type(avg_age_value)

(29.69911764705882, float)

In [97]:
titanic_sdf.fillna(value=avg_age_value, subset=["Age"]).show()

+-----------+--------+------+--------------------+------+-----------------+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex|              Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+-----------------+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|             22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|             38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female|             26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|             35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|             35.0|    0|    0|          373450|   8.05| null|       S|
|          6|       0|     3|    Moran, Mr. James|  male|29.69911764705882|    0|    0|          330877| 8.4583| null|       Q|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|             54.0|    0|    0|           17463|51.8625|  E46|       S|
|          8|       0|     3|Palsson, Master. ...|  male|              2.0|    3|    1|          349909| 21.075| null|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female|             27.0|    0|    2|          347742|11.1333| null|       S|
|         10|       1|     2|Nasser, Mrs. Nich...|female|             14.0|    1|    0|          237736|30.0708| null|       C|
|         11|       1|     3|Sandstrom, Miss. ...|female|              4.0|    1|    1|         PP 9549|   16.7|   G6|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|             58.0|    0|    0|          113783|  26.55| C103|       S|
|         13|       0|     3|Saundercock, Mr. ...|  male|             20.0|    0|    0|       A/5. 2151|   8.05| null|       S|
|         14|       0|     3|Andersson, Mr. An...|  male|             39.0|    1|    5|          347082| 31.275| null|       S|
|         15|       0|     3|Vestrom, Miss. Hu...|female|             14.0|    0|    0|          350406| 7.8542| null|       S|
|         16|       1|     2|Hewlett, Mrs. (Ma...|female|             55.0|    0|    0|          248706|   16.0| null|       S|
|         17|       0|     3|Rice, Master. Eugene|  male|              2.0|    4|    1|          382652| 29.125| null|       Q|
|         18|       1|     2|Williams, Mr. Cha...|  male|29.69911764705882|    0|    0|          244373|   13.0| null|       S|
|         19|       0|     3|Vander Planke, Mr...|female|             31.0|    1|    0|          345763|   18.0| null|       S|
|         20|       1|     3|Masselmani, Mrs. ...|female|29.69911764705882|    0|    0|            2649|  7.225| null|       C|
+-----------+--------+------+--------------------+------+-----------------+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [98]:
spark.stop()